microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
/************************************************************************************************
* MPLAB 16-Bit Device Blocks for Simulink                                                       *
*                                                                                               *
* Product Page:  https://www.mathworks.com/matlabcentral/fileexchange/71892                     *
*         Forum: https://www.microchip.com/forums/f192.aspx                                     *
*         Wiki:  http://microchipdeveloper.com/simulink:start                                   *
*                                                                                               *
* Author:        Lubin Kerhuel, Constantin Velea                                                *
* Company:       Microchip Technology Inc                                                       * 
* Filename:      MCHP_MACRO_AddSumSat.h                                                         *
* Date:          16/02/2017                                                                     *
* File Version:  1.00                                                                           *
*************************************************************************************************

 SOFTWARE LICENSE AGREEMENT:
 Microchip Technology Incorporated ("Microchip") retains all ownership and 
 intellectual property rights in the code accompanying this message and in all 
 derivatives hereto.  You may use this code, and any derivatives created by 
 any person or entity by or on your behalf, exclusively with Microchip's
 proprietary products.  Your acceptance and/or use of this code constitutes 
 agreement to the terms and conditions of this notice.

 CODE ACCOMPANYING THIS MESSAGE IS SUPPLIED BY MICROCHIP "AS IS".  NO 
 WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED 
 TO, IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A 
 PARTICULAR PURPOSE APPLY TO THIS CODE, ITS INTERACTION WITH MICROCHIP'S 
 PRODUCTS, COMBINATION WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 

 YOU ACKNOWLEDGE AND AGREE THAT, IN NO EVENT, SHALL MICROCHIP BE LIABLE, WHETHER 
 IN CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE OR BREACH OF STATUTORY DUTY), 
 STRICT LIABILITY, INDEMNITY, CONTRIBUTION, OR OTHERWISE, FOR ANY INDIRECT, SPECIAL, 
 PUNITIVE, EXEMPLARY, INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, FOR COST OR EXPENSE OF 
 ANY KIND WHATSOEVER RELATED TO THE CODE, HOWSOEVER CAUSED, EVEN IF MICROCHIP HAS BEEN 
 ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT 
 ALLOWABLE BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO 
 THIS CODE, SHALL NOT EXCEED THE PRICE YOU PAID DIRECTLY TO MICROCHIP SPECIFICALLY TO 
 HAVE THIS CODE DEVELOPED.

 You agree that you are solely responsible for testing the code and 
 determining its suitability.  Microchip has no obligation to modify, test, 
 certify, or support the code.

*************************************************************************************************/
#ifndef MCHP_16bit_ADD_SUB_MACRO_H
#define MCHP_16bit_ADD_SUB_MACRO_H

#include <xc.h>
#include "MCHP_MACRO_Saturate.h"

#define MCHP_addSat_CAO_s16_s16_s16(x,y)                                                                \
({                                                                                                      \
int a = (int) (x);                                                                                      \
int b = (int) (y);                                                                                      \
int c;                                                                                                  \
__asm__ volatile(                                                                                       \
"add    %[u1],%[u2],%[u3]   \n\t"    /* Add 16 bits values */                                           \
"bra    NOV, add_end_%=     \n\t"    /* exit if no overflow. */                                         \
"mov    #0x8000, %[u3]      \n\t"    /* saturate to neg (0x8000) */                                     \
"btss   %[u2],#15           \n\t"    /* or pos max (0x7FFF) */                                          \
"mov    #0x7FFF,%[u3]       \n\t"    /* depending on (both) operand sign. */                            \
" add_end_%= :              \n\t"    /* overflow can occur only when both operands have same sign */    \
: [u3] "=&r"(c)                                                                                         \
: [u1] "r"(a) , [u2] "r"(b)                                                                             \
: "cc");                                                                                                \
c;                                                                                                      \
})  

#define MCHP_addSat_CAO_u16_u16_u16(x,y)  /* uint16 (with Saturation) <= uint16 + uint16*/      \
({                                                                                              \
unsigned int a = (unsigned int) (x);                                                            \
unsigned int b = (unsigned int) (y);                                                            \
unsigned int c;                                                                                 \
__asm__ volatile(                                                                               \
"add    %[u1],%[u2],%[u3]   \n\t"     /* add 16 bits parts */                                   \
"btsc    SR,#0              \n\t"     /* if Carry flag is set */                                \
"SETM    %[u3]              \n\t"     /* set output to MAX_UINT16 saturation: 0xFFFF */         \
: [u3] "=r"(c)                                                                                  \
: [u1] "r"(a) , [u2] "r"(b)                                                                     \
: "cc");                                                                                        \
c;                                                                                              \
})                                                                                              \

