microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
#define MCHP_addSat_CAO_s32_s32_s32(x,y) /* int32(with saturation) <= int32 + int32 */                      \
({                                                                                                          \
long int a = (long int) (x);                                                                                \
long int b = (long int) (y);                                                                                \
long int c;                                                                                                 \
int tmpMCHP;                                                                                                \
__asm__ volatile(                                                                                           \
"add    %[u1],%[u2],%[u3]       \n\t"    /* add Lo 16 bits parts */                                         \
"addc   %d[u1],%d[u2],%d[u3]    \n\t"    /* add Hi 16 bits with repported carry */                          \
"bra    NOV, add_end_%=         \n\t"    /* exit if no overflow */                                          \
"mov    #0x7FFF,%d[u3]          \n\t"    /* Set Positive Saturation */                                      \
"mov    #0xFFFF,%[u3]           \n\t"    /* to 0x7FFF FFFF */                                               \
"lsr    %d[u1],#15,%[tmppMCHP]  \n\t"    /* if (both) operands negative (sign bit)*/                        \
"add    %[tmppMCHP],%[u3],%[u3] \n\t"    /* add sign bit (1) to obtain  */                                  \
"addc   %d[u3],#0,%d[u3]        \n\t"    /* negative saturation -1 = 0x8000 0000 */                         \
" add_end_%= :                  \n\t"    /* overflow can occur only when both operands have same sign */    \
: [u3] "=&r"(c) ,[tmppMCHP] "=r"(tmpMCHP)                                                                   \
: [u1] "r"(a) , [u2] "r"(b)                                                                                 \
: "cc");                                                                                                    \
c;                                                                                                          \
})    

#define MCHP_addSat_CAO_u32_u32_u32(x,y)     /* uint32 (with saturation) <= uint32 + uint32*/               \
({                                                                                                          \
unsigned long int a = (unsigned long int) (x);                                                              \
unsigned long int b = (unsigned long int) (y);                                                              \
unsigned long int c;                                                                                        \
__asm__ volatile(                                                                                           \
"add    %[u1],%[u2],%[u3]       \n\t"    /* add Lo 16 bits parts */                                         \
"addc   %d[u1],%d[u2],%d[u3]    \n\t"    /* add Hi 16 bits with repported carry */                          \
"bra    NC, add_end_%=          \n\t"    /* exit if Carry flag is clear */                                  \
"mov    #0xFFFF, %d[u3]         \n\t"    /* Set Positive Saturation */                                      \
"mov    #0xFFFF, %[u3]          \n\t"    /* to 0xFFFF FFFF */                                               \
" add_end_%= :                  \n\t"    /* overflow can occur only when both operands have same sign */    \
: [u3] "=&r"(c)                                                                                              \
: [u1] "r"(a) , [u2] "r"(b)                                                                                 \
: "cc");                                                                                                    \
c;                                                                                                          \
})           

#define MCHP_addSat_CAO_u32_u32_u16(x,y)    /* uint32 (with saturation) <= uint32 + uint16  */              \
({                                                                                                          \
unsigned long int  a = (unsigned long int) (x);                                                             \
unsigned short int b = (unsigned short int)(y);                                                             \
unsigned long int  c;                                                                                       \
__asm__ volatile(                                                                                           \
"add    %[u1],%[u2],%[u3]       \n\t"    /* add Lo 16 bits parts */                                         \
"addc   %d[u1],#0,%d[u3]        \n\t"    /* add Hi 16 bits with repported carry */                          \
"bra    NC, add_end_%=          \n\t"    /* exit if Carry flag is clear */                                  \
"mov    #0xFFFF,%d[u3]          \n\t"    /* Set Positive Saturation */                                      \
"mov    #0xFFFF,%[u3]           \n\t"    /* to 0xFFFF FFFF */                                               \
" add_end_%= :                  \n\t"    /* overflow can occur only when both operands have same sign */    \
: [u3] "=&r"(c)                                                                                              \
: [u1] "r"(a) , [u2] "r"(b)                                                                                 \
: "cc");                                                                                                    \
c;                                                                                                          \
})    

#define MCHP_addSat_CAO_u32_u32_s16(x,y)     /* uint32 (with saturation) <= uint32 + int16  */                          \
({                                                                                                                      \
/* Side remark: Mixed-sign addition never turns on the overflow flag */                                                 \
unsigned long int  a = (unsigned long int) (x);                                                                         \
long int  b = (long int)(y);       /* s16 operand will be sign extended */                                              \
unsigned long int  c;                                                                                                   \
unsigned long int tmpMCHP;                                                                                              \
__asm__ volatile(                                                                                                       \
"btsc   %d[u2], #15                         \n\t"   /* check if s16 is negative */                                      \
"bra    secondOpearandIsNeg_%=              \n\t"   /* branch if s16 is negative */                                     \
"add    %[u1],%[u2],%[u3]                   \n\t"   /* add Lo 16 bits parts */                                          \
"addc   %d[u1],%d[u2],%d[u3]                \n\t"   /* add Hi 16 bits with reported carry */                            \
"bra    NC, add_end_%=                      \n\t"   /* exit if Carry flag is clear */                                   \
"mov    #0xFFFF,%d[u3]                      \n\t"   /* set Positive Saturation */                                       \
"mov    #0xFFFF,%[u3]                       \n\t"   /* to 0xFFFF FFFF */                                                \
"bra    add_end_%=                          \n\t"   /* exit */                                                          \
" secondOpearandIsNeg_%= :                  \n\t"   /* if s16 is negative */                                            \
"NEG    %[u2],%[tmppMCHP]                   \n\t"   /* compute abs(s16) */                                              \
"BTSC   %[tmppMCHP],#15                     \n\t"                                                                       \
"COM    %[tmppMCHP],%[tmppMCHP]             \n\t"                                                                       \
"SUB    %[tmppMCHP],%[u1],%d[tmppMCHP]      \n\t"   /* check if u32 is greater than abs(s16) */                         \
"mov    #0x0000,%d[tmppMCHP]                \n\t"   /* use MSW of "temp" variable as a dummy reg */                     \
"SUBB   %d[tmppMCHP],%d[u1],%d[tmppMCHP]    \n\t"                                                                       \
"BRA    NC,firstOperandIsGreater_%=         \n\t"   /* if uint32 is greater than abs(s16), skip saturation with zero */ \
"mov    #0x0000,%[u3]                       \n\t"   /* saturate result to zero (LSW of the result)*/                    \
"mov    #0x0000,%d[u3]                      \n\t"   /* saturate result to zero (MSW of the result)*/                    \
"bra    add_end_%=                          \n\t"   /* exit */                                                          \
" firstOperandIsGreater_%= :                \n\t"   /* if uint32 is greater than abs(s16)*/                             \
"add    %[u1], %[u2], %[u3]                 \n\t"   /* add Lo 16 bits parts */                                          \
"addc   %d[u1], %d[u2], %d[u3]              \n\t"   /* add Hi 16 bits with reported carry */                            \
" add_end_%= :                              \n\t"   /* overflow can occur only when both operands have same sign */     \
: [u3] "=&r"(c) ,[tmppMCHP] "=&r"(tmpMCHP)                                                                              \
: [u1] "r"(a) , [u2] "r"(b)                                                                                             \
: "cc");                                                                                                                \
c;                                                                                                                      \
}) 

// Addition with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes addition)
#define MCHP_addSat_CBO_u32_u32_s16(x,y)     /* uint32 (with saturation) <= uint32 + int16  */                                                                              \
({                                                                                                                                                                          \
/* Side remark: Mixed-sign addition never turns on the overflow flag */                                                                                                     \
unsigned long int  a = (unsigned long int) (x);                                                                                                                             \
long int  b = (long int)(y);       /* s16 operand will be sign extended */                                                                                                  \
unsigned long int  c;                                                                                                                                                       \
__asm__ volatile(                                                                                                                                                           \
"btsc   %[u2],#15                   \n\t"   /* check if s16 is negative */                                                                                                  \
"bra    secondOpearandIsNeg_%=      \n\t"   /* branch if s16 is negative */                                                                                                 \
"add    %[u1],%[u2],%[u3]           \n\t"   /* add Lo 16 bits parts */                                                                                                      \
"addc   %d[u1],%d[u2],%d[u3]        \n\t"   /* add Hi 16 bits with reported carry */                                                                                        \
"bra    NC, add_end_%=              \n\t"   /* exit if Carry flag is clear */                                                                                               \
"mov    #0xFFFF,%d[u3]              \n\t"   /* set Positive Saturation */                                                                                                   \
"mov    #0xFFFF,%[u3]               \n\t"   /* to 0xFFFF FFFF */                                                                                                            \
"bra    add_end_%=                  \n\t"   /* exit */                                                                                                                      \
" secondOpearandIsNeg_%= :          \n\t"   /* if s16 is negative */                                                                                                        \
"mov    %[u1],%[u3]                 \n\t"   /* s16 will be set to zero before operation takes place (Simulink behaviour) and the result of the addition is u32 value */     \
"mov    %d[u1],%d[u3]               \n\t"   /* saturate result to zero (MSW of the result)*/                                                                                \
" add_end_%= :                      \n\t"   /* end */                                                                                                                       \
: [u3] "=&r"(c)                                                                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                                 \
: "cc");                                                                                                                                                                    \
c;                                                                                                                                                                          \
}) 

#define MCHP_addSat_CAO_s32_u32_s16(x,y)  /* int32 (with saturation) <= uint32 + int16 */                   \
({                                                                                                          \
/* Side remark:  the saturation can only be positive, no underflow can possibly occur */                    \
unsigned long int a = (unsigned long int) (x);                                                              \
long int b = (long int)(y);       /* s16 operand will be sign extended */                                   \
long int c =0;                                                                                              \
__asm__ volatile(                                                                                           \
"btsc   %d[u1],#15                  \n\t"   /* add Lo 16 bits parts */                                      \
"bra    saturate_%=                 \n\t"   /* add Lo 16 bits parts */                                      \
"add    %[u1],%[u2],%[u3]           \n\t"   /* add Lo 16 bits parts */                                      \
"addc   %d[u1],%d[u2],%d[u3]        \n\t"   /* add Hi 16 bits with reported carry */                        \
"bra    NOV, add_end_%=             \n\t"   /* exit if no Carry occurred */                                 \
" saturate_%= :                     \n\t"   /* saturate */                                                  \
"mov    #0x7FFF,%d[u3]              \n\t"   /* Set int32 MAX Saturation */                                  \
"mov    #0xFFFF,%[u3]               \n\t"   /* to 0x7FFF FFFF */                                            \
" add_end_%= :                      \n\t"   /* overflow can occur only when both operands have same sign */ \
: [u3] "=&r"(c)                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                 \
: "cc");                                                                                                    \
c;                                                                                                          \
}) 


// Addition with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes addition)
#define MCHP_addSat_CBO_u32_s32_u16(x,y)  /* int32 (with saturation) <= uint32 + int16 */                                                                                   \
({                                                                                                                                                                          \
/* Side remark: Mixed-sign addition never turns on the overflow flag */                                                                                                     \
long int  a = (long int) (x);                                                                                                                                               \
unsigned long int  b = (unsigned long int)(y); /* s16 operand will be sign extended */                                                                                      \
unsigned long int  c;                                                                                                                                                       \
__asm__ volatile(                                                                                                                                                           \
"btsc   %d[u1],#15                  \n\t"   /* check if s16 is negative */                                                                                                  \
"bra    firstOpearandIsNeg_%=       \n\t"   /* branch if s16 is negative */                                                                                                 \
"add    %[u1],%[u2],%[u3]           \n\t"   /* add Lo 16 bits parts */                                                                                                      \
"addc   %d[u1], %d[u2], %d[u3]      \n\t"   /* add Hi 16 bits with reported carry */                                                                                        \
"bra    NC, add_end_%=              \n\t"   /* exit if Carry flag is clear */                                                                                               \
"mov    #0xFFFF,%d[u3]              \n\t"   /* set Positive Saturation */                                                                                                   \
"mov    #0xFFFF,%[u3]               \n\t"   /* to 0xFFFF FFFF */                                                                                                            \
"bra    add_end_%=                  \n\t"   /* exit */                                                                                                                      \
" firstOpearandIsNeg_%= :           \n\t"   /* if s16 is negative */                                                                                                        \
"mov    %[u2],%[u3]                 \n\t"   /* s16 will be set to zero before operation takes place (Simulink behaviour) and the result of the addition is u32 value */     \
"mov    %d[u2],%d[u3]               \n\t"   /* saturate result to zero (MSW of the result)*/                                                                                \
" add_end_%= :                      \n\t"   /* end */                                                                                                                       \
: [u3] "=&r"(c)                                                                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                                 \
: "cc");                                                                                                                                                                    \
c;                                                                                                                                                                          \
}) 


// Addition with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes addition)
#define MCHP_addSat_CBO_u32_s32_s16(x,y)  /* int32 (with saturation) <= uint32 + int16 */                   \
({                                                                                                          \
long int a = (long int) (x);                                                                                \
long int b = (long int) (y);                                                                                \
unsigned long int c = 0x0;                                                                                  \
__asm__ volatile(                                                                                           \
"btsc   %d[u1],#15              \n\t"    /* test if s32 is negative */                                      \
"mov.d  %[u3],%[u1]             \n\t"    /* if s32 is negative, saturate it to Zero */                      \
"btsc   %d[u2],#15              \n\t"    /* test if s16 is negative */                                      \
"mov.d  %[u3],%[u2]             \n\t"    /* if s16 is negative, saturate it to Zero */                      \
"add    %[u1],%[u2],%[u3]       \n\t"    /* add Lo 16 bits parts */                                         \
"addc   %d[u1],%d[u2],%d[u3]    \n\t"    /* add Hi 16 bits with repported carry */                          \
" add_end_%= :                  \n\t"    /* overflow can occur only when both operands have same sign */    \
: [u3] "+r"(c)                                                                                              \
: [u1] "r"(a) , [u2] "r"(b)                                                                                 \
: "cc");                                                                                                    \
c;                                                                                                          \
})  



