microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
#define MCHP_addSat_CAO_u32_s32_u16(x,y)   /* uint32 (with saturation) <= int32 + uint16 */             \
({                                                                                                      \
long int  a = (long int) (x);                                                                           \
unsigned long int  b = (unsigned long int)(y);     /* s16 operand will be sign extended */              \
unsigned long int  c;                                                                                   \
__asm__ volatile(                                                                                       \
"btsc   %d[u1],#15                  \n\t"   /* check if s32 is negative */                              \
"bra    firstOpearandIsNeg_%=       \n\t"   /* branch if s32 is negative */                             \
"add    %[u1],%[u2],%[u3]           \n\t"   /* add Lo 16 bits parts */                                  \
"addc   %d[u1],%d[u2],%d[u3]        \n\t"   /* add Hi 16 bits with reported carry */                    \
"bra    NC, add_end_%=              \n\t"   /* exit if Carry flag is clear */                           \
"mov    #0xFFFF,%d[u3]              \n\t"   /* set Positive Saturation */                               \
"mov    #0xFFFF,%[u3]               \n\t"   /* to 0xFFFF FFFF */                                        \
"bra    add_end_%=                  \n\t"   /* exit */                                                  \
" firstOpearandIsNeg_%= :           \n\t"   /* if s32 is negative */                                    \
"add    %[u1],%[u2],%[u3]           \n\t"   /* add Lo 16 bits parts */                                  \
"addc   %d[u1],%d[u2],%d[u3]        \n\t"   /* add Hi 16 bits with reported carry */                    \
"bra    NN, add_end_%=              \n\t"   /* exit if result is not negative */                        \
"mov    #0x0000,%[u3]               \n\t"   /* if result is negative, saturate to zero */               \
"mov    #0x0000,%d[u3]              \n\t"   /* to 0x0000 0000 */                                        \
" add_end_%= :                      \n\t"   /* exit */                                                  \
: [u3] "=&r"(c)                                                                                         \
: [u1] "r"(a) , [u2] "r"(b)                                                                             \
: "cc");                                                                                                \
c;                                                                                                      \
})    


#define MCHP_addSat_CAO_u32_s32_s16(x,y) /* uint32 (with saturation) <= int32 + int16  */               \
({                                                                                                      \
long int a = (long int) (x);                                                                            \
long int b = (long int) (y);                                                                            \
long int c;                                                                                             \
long int tmpMCHP = 0x0;                                                                                 \
__asm__ volatile(                                                                                       \
"add    %[u1],%[u2],%[u3]       \n\t"   /* add Lo 16 bits parts */                                      \
"addc   %d[u1],%d[u2],%d[u3]    \n\t"   /* add Hi 16 bits with repported carry */                       \
"bra    OV, overflow_%=         \n\t"   /* branch if overflow occurred*/                                \
"btsc   %d[u3],#15              \n\t"   /* otherwise, check if the result is negative */                \
"mov.d  %[tmppMCHP],%[u3]       \n\t"   /* if the result is negative, saturate the output to zero */    \
"bra    add_end_%=              \n\t"   /* exit */                                                      \
" overflow_%= :                 \n\t"   /* rountine to handle overflow case  */                         \
"btss   SR,#3                   \n\t"   /* in overflow condition, use N flag information. If N flag is clear, it means that OV occurred by adding two negative values */ \
"mov.d  %[tmppMCHP],%[u3]       \n\t"   /* saturate to zero if N flag is cleared */                     \
" add_end_%= :                  \n\t"   /* exit */                                                      \
: [u3] "=&r"(c) ,[tmppMCHP] "+r"(tmpMCHP)                                                                \
: [u1] "r"(a) , [u2] "r"(b)                                                                             \
: "cc");                                                                                                \
c;                                                                                                      \
}) 

#define MCHP_addSat_CAO_s8_s8_s8(x,y)  /* signed char8 (with saturation) <= signed char8 + signed char8 */  \
({                                                                                                          \
signed char a = (signed char) (x);                                                                          \
signed char b = (signed char) (y);                                                                          \
signed char c;                                                                                              \
__asm__ volatile(                                                                                           \
"add.b  %[u1],%[u2],%[u3]   \n\t"   /* Add 8 bits values */                                                 \
"bra    NOV, add_end_%=     \n\t"   /* exit if no overflow. */                                              \
"mov.b  #0x80,%[u3]         \n\t"   /* saturate to neg min (0x80) */                                        \
"btss   %[u2],#7            \n\t"   /* or pos max (0x7F) */                                                 \
"mov    #0x7F,%[u3]         \n\t"   /* depending on (both) operand sign. */                                 \
" add_end_%= :              \n\t"   /* overflow can occur only when both operands have same sign */         \
: [u3] "=&r"(c)                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                 \
: "cc");                                                                                                    \
c;                                                                                                          \
})  

#define MCHP_addSat_CAO_u8_u8_u8(x,y)  /* unsigned char8 (with saturation) <= unsigned char8 + unsigned char8 */    \
({                                                                                                                  \
unsigned char a = (unsigned char) (x);                                                                              \
unsigned char b = (unsigned char) (y);                                                                              \
unsigned char c;                                                                                                    \
__asm__ volatile(                                                                                                   \
"add.b   %[u1],%[u2],%[u3]      \n\t"       /* add 8 bits parts */                                                  \
"btsc    SR,#0                  \n\t"       /* if Carry flag is set */                                              \
"mov.b   #0xFF,%[u3]            \n\t"       /* set output to MAX_unsigned char8 saturation: 0x00FF */               \
: [u3] "=r"(c)                                                                                                      \
: [u1] "r"(a) , [u2] "r"(b)                                                                                         \
: "cc");                                                                                                            \
c;                                                                                                                  \
})                                                                                                                  \

/*--------------------------------------- Reversed-operands for primitive macros -------------------------------------------------------------------- */
#define MCHP_addSat_CAO_u32_u16_u32(x,y)    MCHP_addSat_CAO_u32_u32_u16(y,x)   /* uint32(with saturation) <= uint16 + uint32 */
#define MCHP_addSat_CAO_s32_s32_s16(x,y)    MCHP_addSat_CAO_s32_s32_s32(x,y)   /* int32 (with saturation) <= int32 + int16   */ 
#define MCHP_addSat_CAO_s32_s16_s32(x,y)    MCHP_addSat_CAO_s32_s32_s32(x,y)   /* int32 (with saturation) <= int16 + int32   */ 

