microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
/*------------------------------------------------ Special cases for addition ----------------------------------------------------------------------- */
#define MCHP_addSat_CAO_s32_s32_u16(x,y)    MCHP_addSat_CAO_s32_s32_s32(x,y)    /* int32 (with saturation) <= int32 + uint16  */ 
#define MCHP_addSat_CAO_s32_u16_s32(x,y)    MCHP_addSat_CAO_s32_s32_s32(x,y)    /* int32 (with saturation) <= uint16 + int32  */ 
#define MCHP_addSat_CBO_u32_s16_u32(x,y)    MCHP_addSat_CBO_u32_u32_s16(y,x)    /* uint32 (with saturation) <= int16 + uint32 */ 
#define MCHP_addSat_CAO_s32_s16_u32(x,y)    MCHP_addSat_CAO_s32_u32_s16(y,x)    /* int32 (with saturation) <= uint16 + int32  */
#define MCHP_addSat_CBO_u32_u16_s32(x,y)    MCHP_addSat_CBO_u32_s32_u16(y,x)    /* uint32 (with saturation) <= uint16 + int32 */
#define MCHP_addSat_CBO_u32_s16_s32(x,y)    MCHP_addSat_CBO_u32_s32_s16(y,x)    /* uint32 (with saturation) <= int16 + int32  */
#define MCHP_addSat_CAO_u32_s16_u32(x,y)    MCHP_addSat_CAO_u32_u32_s16(y,x)    /* uint32 (with saturation) <= int16 + uint32 */
#define MCHP_addSat_CAO_u32_u16_s32(x,y)    MCHP_addSat_CAO_u32_s32_u16(y,x)    /* uint32 (with saturation) <= uint16 + int32 */
#define MCHP_addSat_CAO_u32_s16_s32(x,y)    MCHP_addSat_CAO_u32_s32_s16(y,x)    /* uint32 (with saturation) <= int16 + int32  */

#define MCHP_addSat_CAO_s32_u32_u16(x,y)    MCHP_SATURATE_U32_TO_S32(MCHP_addSat_CAO_u32_u32_u16(x,y))  /* int32 (with saturation) <= uint32 + uint16 */
#define MCHP_addSat_CAO_s32_u16_u32(x,y)    MCHP_SATURATE_U32_TO_S32(MCHP_addSat_CAO_u32_u32_u32(y,x))  /* int32 (with saturation) <= uint16 + uint32 */

/*-------------------------------------------- 8-bit/16-bit mixed-sign addition --------------------------------------------------------------------- */
#define MCHP_addSat_CAO_s16_s8_s16(x,y)     MCHP_addSat_CAO_s16_s16_s16(x,y)   /* int16 (with saturation) <= int8 + int16    */
#define MCHP_addSat_CAO_s16_s16_s8(x,y)     MCHP_addSat_CAO_s16_s16_s16(x,y)   /* int16 (with saturation) <= int16 + int8    */
#define MCHP_addSat_CAO_u16_u8_u16(x,y)     MCHP_addSat_CAO_u16_u16_u16(x,y)   /* uint16 (with saturation) <= uint8 + uint16 */
#define MCHP_addSat_CAO_u16_u16_u8(x,y)     MCHP_addSat_CAO_u16_u16_u16(x,y)   /* uint16 (with saturation) <= uint16 + uint8 */

#define MCHP_addSat_CAO_s8_s8_s16(x,y)      MCHP_SATURATE_S16_TO_S8(MCHP_addSat_CAO_s16_s16_s16(x,y))  /* int8 (with saturation) <= int8 + int16      */

#define MCHP_addSat_CAO_s8_s16_s8(x,y)      MCHP_SATURATE_S16_TO_S8(MCHP_addSat_CAO_s16_s16_s16(x,y))  /* int8 (with saturation) <= int16 + int8      */
#define MCHP_addSat_CAO_s8_s16_s16(x,y)     MCHP_SATURATE_S16_TO_S8(MCHP_addSat_CAO_s16_s16_s16(x,y))  /* int8 (with saturation) <= int16 + int16     */
#define MCHP_addSat_CAO_s16_s32_s16(x,y)    MCHP_SATURATE_S32_TO_S16(MCHP_addSat_CAO_s32_s32_s16(x,y)) /* int16 (with saturation) <= int32 + int16    */
#define MCHP_addSat_CAO_s16_s16_s32(x,y)    MCHP_SATURATE_S32_TO_S16(MCHP_addSat_CAO_s32_s16_s32(x,y)) /* int16 (with saturation) <= int16 + int32    */
#define MCHP_addSat_CAO_s16_s32_s32(x,y)    MCHP_SATURATE_S32_TO_S16(MCHP_addSat_CAO_s32_s32_s32(x,y)) /* int16 (with saturation) <= int32 + int32    */

#define MCHP_addSat_CAO_u8_u8_u16(x,y)      MCHP_SATURATE_U16_TO_U8(MCHP_addSat_CAO_u16_u16_u16(x,y))  /* uint8 (with saturation) <= uint8 + uint16   */
#define MCHP_addSat_CAO_u8_u16_u8(x,y)      MCHP_SATURATE_U16_TO_U8(MCHP_addSat_CAO_u16_u16_u16(x,y))  /* uint8 (with saturation) <= uint16 + uint8   */
#define MCHP_addSat_CAO_u8_u16_u16(x,y)     MCHP_SATURATE_U16_TO_U8(MCHP_addSat_CAO_u16_u16_u16(x,y))  /* uint8 (with saturation) <= uint16 + uint16  */
#define MCHP_addSat_CAO_u16_u32_u32(x,y)    MCHP_SATURATE_U32_TO_U16(MCHP_addSat_CAO_u32_u32_u32(x,y)) /* uint16 (with saturation) <= uint32 + uint32 */
#define MCHP_addSat_CAO_u16_u16_u32(x,y)    MCHP_SATURATE_U32_TO_U16(MCHP_addSat_CAO_u32_u16_u32(x,y)) /* uint16 (with saturation) <= uint16 + uint32 */
#define MCHP_addSat_CAO_u16_u32_u16(x,y)    MCHP_SATURATE_U32_TO_U16(MCHP_addSat_CAO_u32_u32_u16(x,y)) /* uint16 (with saturation) <= uint32 + uint32 */




/*=====================================================================================================================================================*/
/*                                                  SUBTRACTION WITH SATURATION                                                                        */     
/*=====================================================================================================================================================*/

#define MCHP_subSat_CAO_s16_s16_s16(x,y) /* int16(with saturation) <= int16 - int16 */                      \
({                                                                                                          \
int a = (int) (x);                                                                                          \
int b = (int) (y);                                                                                          \
int c;                                                                                                      \
__asm__ volatile(                                                                                           \
"sub    %[u1],%[u2],%[u3]       \n\t"   /* subtract 16 bits values */                                       \
"bra    NOV, sub_end_%=         \n\t"   /* branch if underflow */                                           \
"mov    #0x7FFF,%[u3]           \n\t"   /* saturate to max int16 */                                         \
"btss   %[u2],#15               \n\t"   /* check if u2 is negative */                                       \
"mov    #0x8000,%[u3]           \n\t"   /* if u2 is negative, saturate to min int16 */                      \
" sub_end_%= :                  \n\t"   /* underflow can occur only when operands have opposite signs */    \
: [u3] "=&r"(c)                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                 \
: "cc");                                                                                                    \
c;                                                                                                          \
}) 


#define MCHP_subSat_CAO_u16_u16_u16(x,y)  /*uint16(with saturation)<=uint16 - uint16*/      \
({                                                                                          \
unsigned int a = (unsigned int) (x);                                                        \
unsigned int b = (unsigned int) (y);                                                        \
unsigned int c;                                                                             \
__asm__ volatile(                                                                           \
"sub    %[u1],%[u2],%[u3]     \n\t"   /* subtract 16 bits values */                         \
"btss   SR,#0                 \n\t"   /* skip next instr if Carry(!Borrow) flag is set */   \
"clr    %[u3]                 \n\t"   /* otherwise, saturate to MIN uint16 */               \
: [u3] "=r"(c)                                                                              \
: [u1] "r"(a) , [u2] "r"(b)                                                                 \
: "cc");                                                                                    \
c;                                                                                          \
})


#define MCHP_subSat_CAO_s32_s32_s32(x,y)   /* int32(with saturation<= int32 - int32 */                              \
({                                                                                                                  \
/* Underflow can occur when opperands have opposite signs */                                                        \
long int a = (long int) (x);                                                                                        \
long int b = (long int) (y);                                                                                        \
long int c;                                                                                                         \
int tmpMCHP;                                                                                                        \
__asm__ volatile(                                                                                                   \
"sub    %[u1],%[u2],%[u3]           \n\t"    /* sub Lo 16 bits parts */                                             \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"    /* sub Hi 16 bits with reported borrow */                              \
"bra    NOV, sub_end_%=             \n\t"    /* exit if no underflow. Carry negated flag is used as Borrow flag */  \
"mov    #0x7FFF,%d[u3]              \n\t"    /* Set NEG Saturation */                                               \
"mov    #0xFFFF,%[u3]               \n\t"    /* to 0x7FFF FFFF */                                                   \
"lsr    %d[u1],#15,%[tmppMCHP]      \n\t"    /* if (both) operands negative(sign bit)*/                             \
"add    %[tmppMCHP],%[u3],%[u3]     \n\t"    /* add sign bit (1) to obtain  */                                      \
"addc   %d[u3],#0,%d[u3]            \n\t"    /* positive saturation  = 0x7FFF FFFF */                               \
" sub_end_%= :                      \n\t"    /* underflow can occur only when operands have opposite signs */       \
: [u3] "=&r"(c) ,[tmppMCHP] "=r"(tmpMCHP)                                                                           \
: [u1] "r"(a) , [u2] "r"(b)                                                                                         \
: "cc");                                                                                                            \
c;                                                                                                                  \
})            
 

