microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
#define MCHP_subSat_CAO_u32_u32_u32(x,y)     /* uint32 (with saturation) <= uint32 - uint32*/                                                                           \
({                                                                                                                                                                      \
unsigned long int a = (unsigned long int) (x);                                                                                                                          \
unsigned long int b = (unsigned long int) (y);                                                                                                                          \
unsigned long int c;                                                                                                                                                    \
__asm__ volatile(                                                                                                                                                       \
"sub    %[u1],%[u2],%[u3]       \n\t"    /* sub Lo 16 bits parts */                                                                                                     \
"subb   %d[u1],%d[u2],%d[u3]    \n\t"    /* sub Hi 16 bits with reported borrow */                                                                                      \
"bra    C, sub_end_%=           \n\t"    /* saturate to MIN_UINT16 if Carry flag is cleared, exit otherwise. For sub instruction, this means that we had a Borrow */    \
"mov    #0x0000,%d[u3]          \n\t"    /* Set MAX_UINT16 Positive Saturation */                                                                                       \
"mov    #0x0000,%[u3]           \n\t"    /* to 0x0000 0000 */                                                                                                           \
" sub_end_%= :                  \n\t"    /* only underflow conditions can occur when subtracting two uint32 variables */                                                \
: [u3] "=r"(c)                                                                                                                                                          \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                             \
: "cc");                                                                                                                                                                \
c;                                                                                                                                                                      \
})  


#define MCHP_subSat_CAO_s32_u16_u32(x,y)   /* int32(with saturation<= u16 - u32 */  \
({                                                                                  \
unsigned long int a = (unsigned long int) (x);                                      \
unsigned long int b = (unsigned long int) (y);                                      \
long int c;                                                                         \
__asm__ volatile(                                                                   \
"btsc   %d[u2],#15              \n\t"   /* check MSbit of u32 */                    \
"bra    secondOpHasMSb1_%=      \n\t"   /* branch if MSbit of u32 is set */         \
"sub    %[u1],%[u2],%[u3]       \n\t"   /* sub Lo 16 bits parts */                  \
"subb   %d[u1],%d[u2],%d[u3]    \n\t"   /* sub Hi 16 bits with reported borrow */   \
"bra    sub_end_%=              \n\t"   /* exit */                                  \
" secondOpHasMSb1_%= :          \n\t"   /* when MSbit of u32 is set */              \
"sub    %[u1],%[u2],%[u3]       \n\t"   /* sub Lo 16 bits parts */                  \
"subb   %d[u1],%d[u2],%d[u3]    \n\t"   /* sub Hi 16 bits with reported borrow */   \
"bra    N,sub_end_%=            \n\t"   /* exit if result is negative */            \
"mov    #0x8000,%d[u3]          \n\t"   /* otherwise, saturate to MIN_INT32  */     \
"mov    #0x0000,%[u3]           \n\t"   /* to 0x8000 0000 */                        \
" sub_end_%= :                  \n\t"                                               \
: [u3] "=&r"(c)                                                                     \
: [u1] "r"(a) , [u2] "r"(b)                                                         \
: "cc");                                                                            \
c;                                                                                  \
})            


#define MCHP_subSat_CAO_u32_u32_s16(x,y)    /* uint32 (with saturation) <= uint32 - int16  */                                                               \
/* this macro can also handle u32_u32_s32 */                                                                                                                \
({                                                                                                                                                          \
unsigned long int  a = (unsigned long int) (x);                                                                                                             \
long int  b = (long int)(y);       /* s16 operand will be sign extended */                                                                                  \
unsigned long int  c;                                                                                                                                       \
__asm__ volatile(                                                                                                                                           \
"btsc   %d[u2],#15                  \n\t"   /* check if s16 is negative */                                                                                  \
"bra    secondOpearandIsNeg_%=      \n\t"   /* branch if s16 is negative */                                                                                 \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                                                                      \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                                                                       \
"bra    C,sub_end_%=                \n\t"   /* exit if no borrow occured. Otherwise, saturate if borrow occured */                                          \
"mov    #0x0000,%d[u3]              \n\t"   /* set MIN_UINT32 Saturation */                                                                                 \
"mov    #0x0000,%[u3]               \n\t"   /* to 0x0000 0000 */                                                                                            \
"bra    sub_end_%=                  \n\t"   /* exit */                                                                                                      \
" secondOpearandIsNeg_%= :          \n\t"   /* if s16 is negative */                                                                                        \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* If second operand is negative, it basically means that we must add u32 and abs(s16) in unsigned_32 mode*/    \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"                                                                                                                   \
"BRA    NC,sub_end_%=               \n\t"   /* if uint32 is greater than abs(s16), skip saturation to MAX */                                                \
"mov    #0xFFFF, %[u3]              \n\t"   /* saturate result to FFFF (LSW of the result)*/                                                                \
"mov    #0xFFFF, %d[u3]             \n\t"   /* saturate result to FFFF (MSW of the result)*/                                                                \
" sub_end_%= :                      \n\t"   /* overflow can occur only when both operands have same sign */                                                 \
: [u3] "=&r"(c)                                                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                 \
: "cc");                                                                                                                                                    \
c;                                                                                                                                                          \
})
   

#define MCHP_subSat_CAO_u32_s16_u32(x,y)    /* uint32 (with saturation) <= uint32 - int16  */                                                               \
({                                                                                                                                                          \
long int  a = (long int) (x);                                                                                                                               \
unsigned long int  b = (unsigned long int)(y);                                                                                                              \
unsigned long int  c;                                                                                                                                       \
__asm__ volatile(                                                                                                                                           \
"btsc   %d[u1],#15                  \n\t"   /* check if s16 is negative */                                                                                  \
"bra    firstOpearandIsNeg_%=       \n\t"   /* branch if s16 is negative */                                                                                 \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                                                                      \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                                                                       \
"bra    NN,sub_end_%=               \n\t"   /* exit if no borrow occured. Otherwise, saturate if borrow occured */                                          \
" firstOpearandIsNeg_%= :           \n\t"   /* if s16 is negative */                                                                                        \
"mov    #0x0000,%[u3]               \n\t"   /* saturate result to FFFF (LSW of the result)*/                                                                \
"mov    #0x0000,%d[u3]              \n\t"   /* saturate result to FFFF (MSW of the result)*/                                                                \
" sub_end_%= :                      \n\t"   /* overflow can occur only when both operands have same sign */                                                 \
: [u3] "=&r"(c)                                                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                 \
: "cc");                                                                                                                                                    \
c;                                                                                                                                                          \
})


// Subtraction with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes subtraction)
#define MCHP_subSat_CBO_u32_u32_s16(x,y)     /* uint32 (with saturation) <= uint32 - int16  */                                                                              \
({                                                                                                                                                                          \
unsigned long int  a = (unsigned long int) (x);                                                                                                                             \
long int  b = (long int)(y);       /* s16 operand will be sign extended */                                                                                                  \
unsigned long int  c;                                                                                                                                                       \
__asm__ volatile(                                                                                                                                                           \
"btsc   %[u2], #15                  \n\t"   /* check if s16 is negative */                                                                                                  \
"bra    secondOpearandIsNeg_%=      \n\t"   /* branch if s16 is negative */                                                                                                 \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                                                                                      \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with Borrow */                                                                                                \
"bra    C, sub_end_%=               \n\t"   /* exit if Carry flag is clear */                                                                                               \
"mov    #0x0000,%d[u3]              \n\t"   /* set saturation to MIN_UINT16 */                                                                                              \
"mov    #0x0000,%[u3]               \n\t"   /* to 0x0000 0000 */                                                                                                            \
"bra    sub_end_%=                  \n\t"   /* exit */                                                                                                                      \
" secondOpearandIsNeg_%= :          \n\t"   /* if s16 is negative */                                                                                                        \
"mov    %[u1],%[u3]                 \n\t"   /* s16 will be set to zero before operation takes place (Simulink behaviour) and the result of the addition is u32 value */     \
"mov    %d[u1],%d[u3]               \n\t"   /* saturate result to zero (MSW of the result)*/                                                                                \
" sub_end_%= :                      \n\t"   /* end */                                                                                                                       \
: [u3] "=&r"(c)                                                                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                                 \
: "cc");                                                                                                                                                                    \
c;                                                                                                                                                                          \
}) 


// Subtraction with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes subtraction)
#define MCHP_subSat_CBO_u32_s16_u32(x,y)     /* uint32 (with saturation) <= uint32 - int16  */                                                                              \
({                                                                                                                                                                          \
long int  a = (long int) (x);                                                                                                                                               \
unsigned long int  b = (unsigned long int)(y);                                                                                                                              \
unsigned long int  c;                                                                                                                                                       \
__asm__ volatile(                                                                                                                                                           \
"btsc   %[u1],#15                   \n\t"   /* check if s16 is negative */                                                                                                  \
"bra    firstOperandIsNeg_%=        \n\t"   /* branch if s16 is negative */                                                                                                 \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                                                                                      \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with Borrow */                                                                                                \
"bra    NN, sub_end_%=              \n\t"   /* exit if Carry flag is clear */                                                                                               \
" firstOperandIsNeg_%= :            \n\t"   /* if s16 is negative */                                                                                                        \
"mov    #0x0000,%d[u3]              \n\t"   /* set saturation to MIN_UINT16 */                                                                                              \
"mov    #0x0000,%[u3]               \n\t"   /* to 0x0000 0000 */                                                                                                            \
" sub_end_%= :                      \n\t"   /* end */                                                                                                                       \
: [u3] "=r"(c)                                                                                                                                                              \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                                 \
: "cc");                                                                                                                                                                    \
c;                                                                                                                                                                          \
}) 


#define MCHP_subSat_CAO_s32_u32_s16(x,y)  /* int32 (with saturation) <= uint32 - int16 */                       \
({                                                                                                              \
unsigned long int a = (unsigned long int) (x);                                                                  \
long int b = (long int)(y);       /* s16 operand will be sign extended */                                       \
long int c;                                                                                                     \
__asm__ volatile(                                                                                               \
"btsc   %d[u1], #15                 \n\t"   /* check if MSb of u32 is set */                                    \
"bra    signedSubtraction_%=        \n\t"   /* brach if MSb of u32 is set */                                    \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                          \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                           \
"bra    NOV, sub_end_%=             \n\t"   /* exit if no Overflow occurred*/                                   \
"mov    #0x7FFF,%d[u3]              \n\t"   /* Set int32 MAX Saturation */                                      \
"mov    #0xFFFF,%[u3]               \n\t"   /* to 0x7FFF FFFF */                                                \
"bra    sub_end_%=                  \n\t"   /* exit  */                                                         \
" signedSubtraction_%= :            \n\t"   /* if MSb of int32 is set*/                                         \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                          \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                           \
"bra    NC, sub_end_%=              \n\t"   /* exit if no Borrow reported */                                    \
"mov    #0x7FFF,%d[u3]              \n\t"   /* Set int32 MAX Saturation */                                      \
"mov    #0xFFFF,%[u3]               \n\t"   /* to 0x7FFF FFFF */                                                \
" sub_end_%= :                      \n\t"   /* underflow can occur only when operands have opposite signs */    \
: [u3] "=&r"(c)                                                                                                 \
: [u1] "r"(a) , [u2] "r"(b)                                                                                     \
: "cc");                                                                                                        \
c;                                                                                                              \
}) 


