microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
#define MCHP_subSat_CAO_s32_s16_u32(x,y)  /* int32 (with saturation) <= uint32 - int16 */                       \
({                                                                                                              \
long int a = (long int) (x);                                                                                    \
unsigned long int b = (unsigned long int)(y);                                                                   \
long int c;                                                                                                     \
__asm__ volatile(                                                                                               \
"btsc   %d[u1],#15                  \n\t"   /* check if s16 is negative */                                      \
"bra    firstOpNegative%=           \n\t"   /* branch if s16 is negative */                                     \
"btsc   %d[u2],#15                  \n\t"   /* check if MSb of u32 is set */                                    \
"bra    secondOpNegative%=          \n\t"   /* branch if MSb of u32 is set */                                   \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                          \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                           \
"bra    NOV, sub_end_%=             \n\t"   /* exit if no Overflow occurred*/                                   \
"bra    saturateToMin%=             \n\t"   /* if no overflow occured, brach to Saturation routine */           \
"bra    sub_end_%=                  \n\t"   /* otherwise exit*/                                                 \
" secondOpNegative%= :              \n\t"   /* when seocnd operand is "negative" */                             \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                          \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                           \
"bra    NOV, saturateToMin%=        \n\t"   /* saturate if no Overflow occurred*/                               \
"bra    sub_end_%=                  \n\t"   /* exit */                                                          \
" firstOpNegative%= :               \n\t"   /* when s16 is negative */                                          \
"btsc   %d[u2], #15                 \n\t"   /* test if MSbit of u32 is set */                                   \
"bra    saturateToMin%=             \n\t"   /* saturate if MSbit of u32 is set*/                                \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                          \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                           \
"bra    NOV, sub_end_%=             \n\t"   /* exit if no Overflow occurred*/                                   \
" saturateToMin%= :                 \n\t"   /* saturation rountine*/                                            \
"mov    #0x8000,%d[u3]              \n\t"   /* Set MIN_INT32 Saturation */                                      \
"mov    #0x0000,%[u3]               \n\t"   /* to 0x8000 0000 */                                                \
" sub_end_%= :                      \n\t"   /* exit */                                                          \
: [u3] "=&r"(c)                                                                                                 \
: [u1] "r"(a) , [u2] "r"(b)                                                                                     \
: "cc");                                                                                                        \
c;                                                                                                              \
}) 


// Subtraction with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes)
#define MCHP_subSat_CBO_u32_s32_u16(x,y)  /* int32 (with saturation) <= uint32 - int16 */                                   \
({                                                                                                                          \
long int  a = (long int)(x);                                                                                                \
unsigned long int  b = (unsigned long int)(y);                                                                              \
unsigned long int  c;                                                                                                       \
__asm__ volatile(                                                                                                           \
"btsc   %d[u1],#15                  \n\t"   /* check if s32 is negative */                                                  \
"bra    saturateToZero_%=           \n\t"   /* if s32 operand is negative, then saturate the output to ZERO right away */   \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                                      \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                                       \
"bra    NN, sub_end_%=              \n\t"   /* if the result is positive, then exit */                                      \
" saturateToZero_%= :               \n\t"   /* if the result is negative */                                                 \
"mov    #0x0000,%d[u3]              \n\t"   /* set MIN_UINT32 saturation */                                                 \
"mov    #0x0000,%[u3]               \n\t"   /* to 0x0000 0000*/                                                             \
" sub_end_%= :                      \n\t"   /* exit */                                                                      \
: [u3] "+&r"(c)                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                 \
: "cc");                                                                                                                    \
c;                                                                                                                          \
}) 


// Subtraction with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes)
#define MCHP_subSat_CBO_u32_s32_u16(x,y)  /* int32 (with saturation) <= uint32 - int16 */                                   \
({                                                                                                                          \
long int  a = (long int)(x);                                                                                                \
unsigned long int  b = (unsigned long int)(y);                                                                              \
unsigned long int  c;                                                                                                       \
__asm__ volatile(                                                                                                           \
"btsc   %d[u1],#15                  \n\t"   /* check if s32 is negative */                                                  \
"bra    saturateToZero_%=           \n\t"   /* if s32 operand is negative, then saturate the output to ZERO right away */   \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                                      \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                                       \
"bra    NN, sub_end_%=              \n\t"   /* if the result is positive, then exit */                                      \
" saturateToZero_%= :               \n\t"   /* if the result is negative */                                                 \
"mov    #0x0000,%d[u3]              \n\t"   /* set MIN_UINT32 saturation */                                                 \
"mov    #0x0000,%[u3]               \n\t"   /* to 0x0000 0000*/                                                             \
" sub_end_%= :                      \n\t"   /* exit */                                                                      \
: [u3] "+&r"(c)                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                 \
: "cc");                                                                                                                    \
c;                                                                                                                          \
}) 


// Subtraction with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes)
#define MCHP_subSat_CBO_u32_s32_s16(x,y)  /* int32 (with saturation) <= uint32 - int16 */       \
({                                                                                              \
long int a = (long int) (x);                                                                    \
long int b = (long int) (y);                                                                    \
unsigned long int c = 0x0000;                                                                   \
__asm__ volatile(                                                                               \
"btsc   %d[u1],#15                  \n\t"   /* test if s32 is negative */                       \
"mov.d  %[u3],%[u1]                 \n\t"   /* if s32 is negative, saturate it to Zero */       \
"btsc   %d[u2],#15                  \n\t"   /* test if s16 is negative */                       \
"mov.d  %[u3],%[u2]                 \n\t"   /* if s16 is negative, saturate it to Zero */       \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                          \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with borrow */                    \
"bra    NN, sub_end_%=              \n\t"   /* if the result is positive, then exit */          \
" saturateToZero_%= :               \n\t"   /* if the result is negative */                     \
"mov    #0x0000,%d[u3]              \n\t"   /* set MIN_UINT32 saturation */                     \
"mov    #0x0000,%[u3]               \n\t"   /* to 0x0000 0000*/                                 \
" sub_end_%= :                      \n\t"                                                       \
: [u3] "+r"(c)                                                                                  \
: [u1] "r"(a) , [u2] "r"(b)                                                                     \
: "cc");                                                                                        \
c;                                                                                              \
})  


// Subtraction with saturation for Cast-Before-Operation (Simulink default behaviour for 32bit-mixed datatypes)
#define MCHP_subSat_CBO_u32_u16_s32(x,y)  /* int32 (with saturation) <= uint32 - int16 */                       \
({                                                                                                              \
unsigned long int a = (unsigned long int) (x);                                                                  \
long int b = (long int) (y);                                                                                    \
unsigned long int c ;                                                                                           \
__asm__ volatile(                                                                                               \
"btsc   %d[u2],#15                  \n\t"   /* test if s32 is negative */                                       \
"bra    secondOpIsNeg%=             \n\t"   /* if s32 is positive, then continue */                             \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                          \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with borrow */                                    \
"bra    NN, sub_end_%=              \n\t"   /* if the result is negative, it should be saturated to zero */     \
"mov    #0x0,%[u3]                  \n\t"   /* set MIN_UINT32 saturation */                                     \
"mov    #0x0,%d[u3]                 \n\t"   /* to 0x0000 0000*/                                                 \
"bra    sub_end_%=                  \n\t"   /* exit */                                                          \
" secondOpIsNeg%= :                 \n\t"   /* if s32 is negative */                                            \
"mov    %[u1],%[u3]                 \n\t"   /* the result is the value of u16 */                                \
"mov    %d[u1],%d[u3]               \n\t"                                                                       \
" sub_end_%= :                      \n\t"                                                                       \
: [u3] "+r"(c)                                                                                                  \
: [u1] "r"(a) , [u2] "r"(b)                                                                                     \
: "cc");                                                                                                        \
c;                                                                                                              \
})  


#define MCHP_subSat_CAO_u32_s32_u16(x,y)   /* uint32 (with saturation) <= int32 - uint16 */                                                                 \
({                                                                                                                                                          \
long int  a = (long int) (x);                                                                                                                               \
unsigned long int  b = (unsigned long int)(y);                                                                                                              \
unsigned long int  c;                                                                                                                                       \
__asm__ volatile(                                                                                                                                           \
"btsc   %d[u1],#15                  \n\t"   /* check if s16 is negative */                                                                                  \
"bra    firstOpearandIsNeg_%=       \n\t"   /* branch if s16 is negative */                                                                                 \
"sub    %[u1],%[u2],%[u3]           \n\t"   /* sub Lo 16 bits parts */                                                                                      \
"subb   %d[u1],%d[u2],%d[u3]        \n\t"   /* sub Hi 16 bits with reported borrow */                                                                       \
"bra    NN,sub_end_%=               \n\t"   /* exit if no borrow occured. Otherwise, saturate if borrow occured */                                          \
" firstOpearandIsNeg_%= :           \n\t"   /* if s16 is negative */                                                                                        \
"mov    #0x0000,%[u3]               \n\t"   /* saturate result to FFFF (LSW of the result)*/                                                                \
"mov    #0x0000,%d[u3]              \n\t"   /* saturate result to FFFF (MSW of the result)*/                                                                \
" sub_end_%= :                      \n\t"   /* overflow can occur only when both operands have same sign */                                                 \
: [u3] "=&r"(c)                                                                                                                                             \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                 \
: "cc");                                                                                                                                                    \
c;                                                                                                                                                          \
}) 


