microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
#define MCHP_subSat_CAO_u32_s32_s16(x,y) /* uint32 (with saturation) <= int32 - int16  */                                                                                   \
({                                                                                                                                                                          \
long int a = (long int) (x);                                                                                                                                                \
long int b = (long int) (y);                                                                                                                                                \
long int c;                                                                                                                                                                 \
long int tmpMCHP = 0x0;                                                                                                                                                     \
__asm__ volatile(                                                                                                                                                           \
"sub    %[u1],%[u2],%[u3]       \n\t"   /* sub Lo 16 bits parts */                                                                                                          \
"subb   %d[u1],%d[u2],%d[u3]    \n\t"   /* sub Hi 16 bits with repported carry */                                                                                           \
"bra    NOV, label_%=           \n\t"   /* branch if overflow occurred*/                                                                                                    \
"btss   %d[u3],#15              \n\t"   /* otherwise, check if the result is negative */                                                                                    \
"mov.d  %[tmppMCHP],%[u3]       \n\t"   /* if the result is negative, saturate the output to zero */                                                                        \
"bra    sub_end_%=              \n\t"   /* exit */                                                                                                                          \
" label_%= :                    \n\t"   /* rountine to handle overflow case  */                                                                                             \
"btsc   SR,#3                   \n\t"   /* in overflow condition, use N flag information. If N flag is clear, it means that OV occurred by adding two negative values */    \
"mov.d  %[tmppMCHP],%[u3]       \n\t"   /* saturate to zero if N flag is cleared */                                                                                         \
" sub_end_%= :                  \n\t"   /* exit */                                                                                                                          \
: [u3] "+r"(c) ,[tmppMCHP] "+r"(tmpMCHP)                                                                                                                                    \
: [u1] "r"(a) , [u2] "r"(b)                                                                                                                                                 \
: "cc");                                                                                                                                                                    \
c;                                                                                                                                                                          \
}) 


#define MCHP_subSat_CAO_s8_s8_s8(x,y)  /* signed char8 (with saturation) <= signed char8 - signed char8 */      \
({                                                                                                              \
signed char a = (signed char) (x);                                                                              \
signed char b = (signed char) (y);                                                                              \
signed char c;                                                                                                  \
__asm__ volatile(                                                                                               \
"sub.b  %[u1], %[u2], %[u3] \n\t"   /* sub 8 bits values */                                                     \
"bra    NOV, sub_end_%=     \n\t"   /* exit if no overflow. */                                                  \
"mov.b  #0x7F, %[u3]        \n\t"   /* saturate to max (0x7F) */                                                \
"btss   %[u2], #7           \n\t"   /* or neg (0x80) */                                                         \
"mov    #0x80,%[u3]         \n\t"   /* depending on (both) operand sign. */                                     \
" sub_end_%= :              \n\t"   /* underflow/overflow can occur only when operands have opposite signs */   \
: [u3] "=&r"(c)                                                                                                 \
: [u1] "r"(a) , [u2] "r"(b)                                                                                     \
: "cc");                                                                                                        \
c;                                                                                                              \
})  


#define MCHP_subSat_CAO_u8_u8_u8(x,y)  /* unsigned char8 (with saturation) <= unsigned char8 - unsigned char8 */    \
({                                                                                                                  \
unsigned char a = (unsigned char) (x);                                                                              \
unsigned char b = (unsigned char) (y);                                                                              \
unsigned char c;                                                                                                    \
__asm__ volatile(                                                                                                   \
"sub.b   %[u1],%[u2],%[u3]      \n\t"       /* sub 8 bits parts */                                                  \
"btss    SR,#0                  \n\t"       /* if Borrow flag is set */                                             \
"mov.b   #0x00,%[u3]            \n\t"       /* set output to 0x00 */                                                \
: [u3] "=r"(c)                                                                                                      \
: [u1] "r"(a) , [u2] "r"(b)                                                                                         \
: "cc");                                                                                                            \
c;                                                                                                                  \
})                                                                                                                  \

