microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/MCHP_MACRO_AddSubSat.h
/*--------------------------------------- Reversed-operands for primitive macros (Subtraction) -------------------------------------------------------------------- */
#define MCHP_subSat_CAO_u32_u32_u16(x,y)    MCHP_subSat_CAO_u32_u32_u32(x,y)   /* uint32(with saturation) <= uint32 - uint16 */
#define MCHP_subSat_CAO_u32_u16_u32(x,y)    MCHP_subSat_CAO_u32_u32_u32(x,y)   /* uint32(with saturation) <= uint16 - uint32 */
#define MCHP_subSat_CAO_s32_s32_s16(x,y)    MCHP_subSat_CAO_s32_s32_s32(x,y)   /* int32 (with saturation) <= int32 - int16   */ 
#define MCHP_subSat_CAO_s32_s16_s32(x,y)    MCHP_subSat_CAO_s32_s32_s32(x,y)   /* int32 (with saturation) <= int16 - int32   */ 

/*------------------------------------------------ Special cases for subtraction ----------------------------------------------------------------------- */
#define MCHP_subSat_CAO_s32_s32_u16(x,y)    MCHP_subSat_CAO_s32_s32_s32(x,y)    /* int32 (with saturation) <= int32 - uint16  */ 
#define MCHP_subSat_CAO_s32_u16_s32(x,y)    MCHP_subSat_CAO_s32_s32_s32(x,y)    /* int32 (with saturation) <= uint16 - int32  */ 
#define MCHP_subSat_CBO_u32_s16_s32(x,y)    MCHP_subSat_CBO_u32_s32_s16(x,y)    /* uint32 (with saturation) <= int16 - int32  */
#define MCHP_subSat_CAO_u32_u16_s32(x,y)    MCHP_subSat_CAO_u32_u32_s16(x,y)    /* uint32 (with saturation) <= uint16 - int32 */
#define MCHP_subSat_CAO_u32_s16_s32(x,y)    MCHP_subSat_CAO_u32_s32_s16(x,y)    /* uint32 (with saturation) <= int16 - int32  */
#define MCHP_subSat_CAO_s32_u32_u16(x,y)    MCHP_SATURATE_U32_TO_S32(MCHP_subSat_CAO_u32_u32_u16(x,y))  /* int32 (with saturation) <= uint32 - uint16 */

/*-------------------------------------------- 8-bit/16-bit mixed-sign subtraction --------------------------------------------------------------------- */
#define MCHP_subSat_CAO_s16_s8_s16(x,y)     MCHP_subSat_CAO_s16_s16_s16(x,y)   /* int16 (with saturation) <= int8 - int16    */
#define MCHP_subSat_CAO_s16_s16_s8(x,y)     MCHP_subSat_CAO_s16_s16_s16(x,y)   /* int16 (with saturation) <= int16 - int8    */
#define MCHP_subSat_CAO_u16_u8_u16(x,y)     MCHP_subSat_CAO_u16_u16_u16(x,y)   /* uint16 (with saturation) <= uint8 - uint16 */
#define MCHP_subSat_CAO_u16_u16_u8(x,y)     MCHP_subSat_CAO_u16_u16_u16(x,y)   /* uint16 (with saturation) <= uint16 - uint8 */

#define MCHP_subSat_CAO_s8_s8_s16(x,y)      MCHP_SATURATE_S16_TO_S8(MCHP_subSat_CAO_s16_s16_s16(x,y))  /* int8 (with saturation) <= int8 - int16      */

#define MCHP_subSat_CAO_s8_s16_s8(x,y)      MCHP_SATURATE_S16_TO_S8(MCHP_subSat_CAO_s16_s16_s16(x,y))  /* int8 (with saturation) <= int16 - int8      */
#define MCHP_subSat_CAO_s8_s16_s16(x,y)     MCHP_SATURATE_S16_TO_S8(MCHP_subSat_CAO_s16_s16_s16(x,y))  /* int8 (with saturation) <= int16 - int16     */
#define MCHP_subSat_CAO_s16_s32_s16(x,y)    MCHP_SATURATE_S32_TO_S16(MCHP_subSat_CAO_s32_s32_s16(x,y)) /* int16 (with saturation) <= int32 - int16    */
#define MCHP_subSat_CAO_s16_s16_s32(x,y)    MCHP_SATURATE_S32_TO_S16(MCHP_subSat_CAO_s32_s16_s32(x,y)) /* int16 (with saturation) <= int16 - int32    */
#define MCHP_subSat_CAO_s16_s32_s32(x,y)    MCHP_SATURATE_S32_TO_S16(MCHP_subSat_CAO_s32_s32_s32(x,y)) /* int16 (with saturation) <= int32 - int32    */

#define MCHP_subSat_CAO_u8_u8_u16(x,y)      MCHP_SATURATE_U16_TO_U8(MCHP_subSat_CAO_u16_u16_u16(x,y))  /* uint8 (with saturation) <= uint8 - uint16   */
#define MCHP_subSat_CAO_u8_u16_u8(x,y)      MCHP_SATURATE_U16_TO_U8(MCHP_subSat_CAO_u16_u16_u16(x,y))  /* uint8 (with saturation) <= uint16 - uint8   */
#define MCHP_subSat_CAO_u8_u16_u16(x,y)     MCHP_SATURATE_U16_TO_U8(MCHP_subSat_CAO_u16_u16_u16(x,y))  /* uint8 (with saturation) <= uint16 - uint16  */
#define MCHP_subSat_CAO_u16_u32_u32(x,y)    MCHP_SATURATE_U32_TO_U16(MCHP_subSat_CAO_u32_u32_u32(x,y)) /* uint16 (with saturation) <= uint32 - uint32 */
#define MCHP_subSat_CAO_u16_u16_u32(x,y)    MCHP_SATURATE_U32_TO_U16(MCHP_subSat_CAO_u32_u16_u32(x,y)) /* uint16 (with saturation) <= uint16 - uint32 */
#define MCHP_subSat_CAO_u16_u32_u16(x,y)    MCHP_SATURATE_U32_TO_U16(MCHP_subSat_CAO_u32_u32_u16(x,y)) /* uint16 (with saturation) <= uint32 - uint32 */

#endif
